import { createContext } from "react";

export type eatListType = {
  name: string;
  comp: string[];
};

export const eatList: eatListType[] = [
  {
    name: "Омлет с картофелем",
    comp: ["картофель", "яйцо", "масло растительное", "соль", "зелёный лук"],
  },
  {
    name: "Гренки с яйцом",
    comp: ["хлеб", "яйцо", "чёрный перец", "соль", "масло сливочное"],
  },
  {
    name: "Жаркое из курицы с овощным миксом",
    comp: [
      "курица",
      "картофель",
      "вода",
      "морковь",
      "лук репчатый",
      "чеснок",
      "зелень",
      "лавровый лист",
      "масло растительное",
      "специи",
    ],
  },
  {
    name: "Куриные котлеты в панировке на сковороде",
    comp: [
      "курица",
      "сухари панировочные",
      "яйца",
      "лук репчатый",
      "мука",
      "масло растительное",
      "перец черный молотый",
      "соль",
    ],
  },
  {
    name: "Запеченный картофель с чесноком и травами в фольге",
    comp: [
      "картофель",
      "чеснок",
      "соль",
      "масло оливковое",
      "листья тмина",
      "розмарин свежий",
    ],
  },
];

export const EatListContext = createContext(eatList);
